app/controllers/clocks_controller.rb

SELECT `clocks`.* FROM `clocks`
---
  def index
    @clocks = Clock.all

INSERT INTO `clocks` (`active`, `created_at`, `current_player`, `key`, `player_one_time`, `player_two_time`, `updated_at`) VALUES (0, '2014-04-03 15:02:17', 1, 'aswbwb', 333.0, 333.0, '2014-04-03 15:02:17')
---
  def create
    @clock = Clock.new(default_params())

    respond_to do |format|
      if @clock.save

UPDATE `clocks` SET `current_player` = 1, `player_two_time` = 59.736783254336, `player_one_time` = 59.996806784088, `updated_at` = '2014-05-06 22:38:31' WHERE `clocks`.`id` = 18
---
  def update

    @clock.updateTimeLeft()

DELETE FROM `clocks` WHERE `clocks`.`id` = 3
---
  def destroy
    @clock.destroy

SELECT `clocks`.* FROM `clocks` WHERE `clocks`.`key` = 'bed8f3dcc2f092ea44bdb01f588f5f71' LIMIT 1
SELECT `clocks`.* FROM `clocks` WHERE `clocks`.`id` = 23 LIMIT 1
---
    def set_clock
      @clock = Clock.where(key: params[:key]).take if params[:key]
      @clock = Clock.find(params[:id]) if !@clock and params[:id]